# Инициализируем переменную значением, введены пользователем
# input -  в качестве аргумента принимает строку, которая будет отображаться пользователю 
# приглашая его ввести данные, а затем читает строку введенную пользователем
user = input("Я Питон. Как твоё имя?: ")
# Вводим строку и значение переменной
print("Добро пожаловать", user)
# Инициализируем ещё одну переменную значением, значением введенным пользователем
# sep - добавляет разделитель для функции print(). Пример sep = "*"(в данном примере
# разделитель выступит знак "*"
# Также по умолчанию функция print() выводи в конце каждой строки неотображаем символ
# новой строки (\n). Существует возможность указать свой символ в онце строки,
# используя параметр end. Например end = "!", выведет в конце каждой строки знак
# "!"
lang = input ("Любимый язык программирования?:")
print (lang, "это", "весело", sep = " ", end = "!\n")
